---
kind: method
id: M:Autodesk.Revit.DB.XYZ.GetLength
zh: 点
source: html/73e56449-890f-e446-9190-6e787f928886.htm
---
# Autodesk.Revit.DB.XYZ.GetLength Method

**中文**: 点

Gets the length of this vector.

## Syntax (C#)
```csharp
public double GetLength()
```

## Remarks
In 3-D Euclidean space, the length of the vector is the square root of the sum
of the three coordinates squared.